Tekla.Structures.Model.PointCloudDataServices.PointCloudDataServices
The point cloud data services.
The following example shows how to use the Tekla.Structures.Model.PointCloudDataServices.PointCloudDataServices class to retrieve point cloud data in Trimble Connect projects
and attach it to a model.
using System.Threading;
using Tekla.Structures.Model;
public class Example
{
public async void Example1()
{
var projects = await PointCloudDataServices.GetProjectsWithPointCloudsAsync();
var pointClouds = projects.First().PointClouds;
var url = await PointCloudDataServices.GetPointCloudUrlAsync(projects.First(), pointClouds.First());
PointCloud pointCloud = new PointCloud
{
Name = pointClouds.First().Name,
Url = url,
TcProjectId = projects.First().Id,
TcPointCloudGuid = pointClouds.First().Id,
LocationBy = Guid.Empty,
UseAutoCreatedBasePoint = true,
Scale = 1.0
};
pointCloud.Attach();
}
}

Tekla.Structures.Model.PointCloudDataServices.PointCloudDataServices.GetProjectsWithPointCloudsAsync
Retrieves the list of Trimble Connect projects with point clouds.
Returns: A task that represents the asynchronous operation. The task result contains a list of projects that have point clouds.

Tekla.Structures.Model.PointCloudDataServices.PointCloudDataServices.GetPointCloudUrlAsync(Tekla.Structures.Model.PointCloudDataServices.TCProject,Tekla.Structures.Model.PointCloudDataServices.TCPointCloud)
Retrieves the URL for a point cloud.
project: The project for which to get the URL.
pointCloud: The point cloud for which to get the URL.
Returns: A task that represents the asynchronous operation. The task result contains a URL.